[
    {
      "title": "Rodent Riddle: Data Visualization Game",
      "year": "2025",
      "image": "/portfolio/images/rodent.png",
      "description": "Built an interactive web app with D3.js to visualize mouse temperature and activity across 20,160 time points. Created a data-driven game to predict mouse type and estrus phase with dynamic visual feedback. Designed responsive UI with tooltips, storytelling text, and modular layout components for two visualization modes.",
      "url": "https://dsc106soir.github.io/rodent_riddle/"
    },
    {
      "title": "Recipe Ratings Analysis",
      "year": "2025",
      "image": "/portfolio/images/recipe.jpg",
      "description": "Analyzed over 200,000 recipes to model rating patterns and ingredient-level impact using Random Forest. Reduced RMSE from 4.79 to 4.45; conducted fairness testing across sugar levels. Visualized trends in recipe popularity and nutritional characteristics using interactive plots."
    },
    {
      "title": "Language Modeling from Project Gutenberg",
      "year": "2025",
      "image": "/portfolio/images/nlp.png",
      "description": "Processed and tokenized over 500,000 words from classic literature using regex and custom start/end markers. Implemented Uniform, Unigram, and N-gram (up to 4-gram) language models with conditional probability estimation. Developed a text generation pipeline using recursive sampling to produce syntactically coherent sequences."
    },
    {
      "title": "Loan Default Prediction",
      "year": "2025",
      "image": "/portfolio/images/loan.png",
      "description": "Built predictive models using logistic regression and decision trees to assess loan default risk based on LendingClub data."
    },
    {
     "title": "Bike Cycle Sync",
     "year": "2025",
     "description": "An interactive D3 + Mapbox visualization showing Boston bike traffic patterns, station flows, and volume by time of day.",
    "image": "/portfolio/images/bikemap.png",
    "url": "https://ishita-takkar.github.io/boston_cycle_sync/"
    }
  ]
  